VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
    if (sensors && (sensors != INV_XYZ_ACCEL))
        /* Latched interrupts only used in LP accel mode. */
        MPU_SetIntLatched(0);

#ifdef AK89xx_SECONDARY
//#ifdef AK89xx_BYPASS
//    if (sensors & INV_XYZ_COMPASS)
//        mpu_set_bypass(1);
//    else
//        mpu_set_bypass(0);
//#else
    user_ctrl = MPU_ReadByte(st->reg->user_ctrl);
    /* Handle AKM power management. */
    if (sensors & INV_XYZ_COMPASS) {
        MPU_SetCompassSampleRate(st->chip_cfg.compass_sample_rate);
        user_ctrl |= BIT_AUX_IF_EN;
    } else {
        Compass_WriteByte(AKM_REG_CNTL, AKM_POWER_DOWN);
        user_ctrl &= ~BIT_AUX_IF_EN;
    }
    if (st->chip_cfg.dmp_on)
        user_ctrl |= BIT_DMP_EN;
    else
        user_ctrl &= ~BIT_DMP_EN;

    /* Enable/disable I2C master mode. */
    if (MPU_WriteByteAndCheck(st->reg->user_ctrl, user_ctrl)) {
        return -3;
    }
//#endif
#endif
    st->chip_cfg.sensors = sensors;
    st->chip_cfg.lp_accel_mode = 0;
    Delay_ms(50);
    return 0;
}

uint8_t Compass_ReadByte(uint8_t reg) {
    uint8_t tmp;
    // I2C address for reading
    MPU_WriteByte(st->reg->s0_addr, READ_COMMAND | st->chip_cfg.compass_addr);
    // reading from ASAX register
    MPU_WriteByte(st->reg->s0_reg, reg);
    // Read 3 bytes
    MPU_WriteByte(st->reg->s0_ctrl, BIT_SLAVE_EN | 1);
    Delay_ms(10); 
    tmp = MPU_ReadByte(EXT_SENS_DATA_00);
    return tmp;
}

void Compass_WriteByte(uint8_t reg, uint8_t data) {
    // Mag I2C address
    MPU_WriteByte(st->reg->s0_addr, WRITE_COMMAND | st->chip_cfg.compass_addr);
    MPU_WriteByte(st->reg->s0_reg, reg);
    MPU_WriteByte(st->reg->s0_do, data);
    // I2C on, 1 byte
    MPU_WriteByte(st->reg->s0_ctrl, BIT_SLAVE_EN | 1);
}

uint8_t Aux_ReadByte(uint8_t i2c_addr, uint8_t reg) {
    uint8_t tmp;
    // Mag I2C address
    MPU_WriteByte(st->reg->s0_addr, READ_COMMAND | i2c_addr);
    MPU_WriteByte(st->reg->s0_reg, reg);
    // I2C on, 1 byte
    MPU_WriteByte(st->reg->s0_ctrl, BIT_SLAVE_EN | 1);
    Delay_ms(10); // experimental minimum with sample rate 200 Hz
    tmp = MPU_ReadByte(EXT_SENS_DATA_00);
    return tmp;
}

void Compass_Read(uint8_t reg, uint8_t *data, uint8_t size) {
    // I2C address for reading
    MPU_WriteByte(st->reg->s0_addr, READ_COMMAND | st->chip_cfg.compass_addr);
    // reading from ASAX register
    MPU_WriteByte(st->reg->s0_reg, reg);
    // Read 3 bytes
    MPU_WriteByte(st->reg->s0_ctrl, BIT_SLAVE_EN | size);
    Delay_ms(15);
    MPU_Read(EXT_SENS_DATA_00, data, 3);
}

/* This initialization is similar to the one in ak8975.c. */
static int setup_compass(void)
{
#ifdef AK89xx_SECONDARY
    uint8_t data[4], akm_addr, user_ctrl;

    //MPU_SetBypass(1);
    // Turn auxiliary I2C on
    user_ctrl = MPU_ReadByte(st->reg->user_ctrl);
    user_ctrl |= BIT_AUX_IF_EN; 
    if (MPU_WriteByteAndCheck(st->reg->user_ctrl, user_ctrl)) {
        return -1;
    }
    Delay_ms(10);

//    /* Find compass. Possible addresses range from 0x0C to 0x0F. */
//    for (akm_addr = 0x0C; akm_addr <= 0x0F; akm_addr++) {
//        data[0] = Aux_ReadByte(akm_addr, AKM_REG_WHOAMI);
//        if (data[0] == AKM_WHOAMI)
//            break;
//    }

//    if (akm_addr > 0x0F) {
//        /* TODO: Handle this case in all compass-related functions. */
//        return -1;
//    }

    akm_addr = 0x0c;
    st->chip_cfg.compass_addr = akm_addr;

    Compass_WriteByte(AKM_REG_CNTL, AKM_POWER_DOWN);
    Delay_ms(10);
    Compass_WriteByte(AKM_REG_CNTL, AKM_FUSE_ROM_ACCESS);
    Delay_ms(10);

    /* Get sensitivity adjustment data from fuse ROM. */
    Compass_Read(AKM_REG_ASAX, data, 3);
    st->chip_cfg.mag_sens_adj[0] = (data[0] - 128)*0.5f / 128.0f + 1.0f;
    st->chip_cfg.mag_sens_adj[1] = (data[1] - 128)*0.5f / 128.0f + 1.0f;
    st->chip_cfg.mag_sens_adj[2] = (data[2] - 128)*0.5f / 128.0f + 1.0f;

    Compass_WriteByte(AKM_REG_CNTL, AKM_POWER_DOWN);
    Delay_ms(10);
    MPU_WriteByte(st->reg->s0_ctrl, ~BIT_SLAVE_EN);

    //MPU_SetBypass(0);
    
    // I2C address for reading
    MPU_WriteByte(I2C_SLV1_ADDR, READ_COMMAND | AK8963_I2C_ADDRESS);
    // reading from HXL register
    MPU_WriteByte(I2C_SLV1_REG, AK8963_HXL);
    // Read 7 bytes
    MPU_WriteByte(I2C_SLV1_CTRL, BIT_SLAVE_EN | 7);

#ifdef MPU9150
    /* For the MPU9150, the auxiliary I2C bus needs to be set to VDD. */
    MPU_WriteByte(st->reg->yg_offs_tc, BIT_I2C_MST_VDDIO);
#endif

    return 0;
#else
    return -16;
#endif
}

/**
 *  @brief      Set device to bypass mode.
 *  @param[in]  bypass_on   1 to enable bypass mode.
 *  @return     0 if successful.
 */
int MPU_SetBypass(uint8_t bypass_on) {
    uint8_t tmp;

    if (st->chip_cfg.bypass_mode == bypass_on)
        return 0;

    if (bypass_on) {
        MPU_WriteByte(st->reg->user_ctrl, tmp);
        tmp &= ~BIT_AUX_IF_EN;
        MPU_WriteByte(st->reg->user_ctrl, tmp);
        Delay_ms(3);
        tmp = BIT_BYPASS_EN;
        if (st->chip_cfg.active_low_int)
            tmp |= BIT_ACTL;
        if (st->chip_cfg.latched_int)
            tmp |= BIT_LATCH_EN | BIT_ANY_RD_CLR;
        MPU_WriteByte(st->reg->int_pin_cfg, tmp);
    } else {
        /* Enable I2C master mode if compass is being used. */
        MPU_WriteByte(st->reg->user_ctrl, tmp);
 
        if (st->chip_cfg.sensors & INV_XYZ_COMPASS)
            tmp |= BIT_AUX_IF_EN;
        else
            tmp &= ~BIT_AUX_IF_EN;
        MPU_WriteByte(st->reg->user_ctrl, tmp);
        Delay_ms(3);
        if (st->chip_cfg.active_low_int)
            tmp = BIT_ACTL;
        else
            tmp = 0;
        if (st->chip_cfg.latched_int)
            tmp |= BIT_LATCH_EN | BIT_ANY_RD_CLR;
        MPU_WriteByte(st->reg->int_pin_cfg, tmp);
    }
    st->chip_cfg.bypass_mode = bypass_on;
    return 0;
}

void MPU_EXTI_Init() {
    GPIOA->OSPEEDR |= 3 << IMU_INT*2;
    
    SYSCFG->EXTICR[0] |= SYSCFG_EXTICR1_EXTI1_PA;
    
    EXTI->RTSR  |= EXTI_RTSR_TR1;       // rising
    EXTI->IMR   |= EXTI_IMR_MR1;        // non-masking
    NVIC_SetPriority(EXTI1_IRQn, 0x02);
    NVIC_EnableIRQ(EXTI1_IRQn);
}

extern DMP *dmp;

void EXTI1_IRQHandler() {
    uint16_t fifo_count = 0;
    uint8_t tmp[2];
    if (EXTI->PR & EXTI_PR_PR1) {
        EXTI->PR = EXTI_PR_PR1;
        
        MPU_Read(FIFO_COUNTH, tmp, 2);
        fifo_count = (tmp[0] << 8) | tmp[1];
        if (fifo_count) {
            MPU_DMA_tx[0] = READ_COMMAND | FIFO_R_W;
            MPU_DMA_Run(MPU_DMA_tx, MPU_DMA_rx, dmp->packet_length + 1);
        }
    }
}

void swap(float *a, float *b) {
    float tmp = *a;
    *a = *b;
    *b = tmp;
}

#include "telemetry.h"
#include "extra_math.h"
#include "data_builder.h"
uint8_t compass_data[8];
float base_euler[3];
extern float euler[3];
uint8_t dmp_algorithm = 0;
uint8_t new_data = 0;
extern Quat orientation;

int get_tick_count(unsigned long *count);
unsigned long timestamp;

long inv_quat[4];
long inv_accel[3];
short inv_gyro[3];
long inv_compass[3];

static void parse_quat_accel_gyro(uint8_t *raw_data, long *quat, long *accel, short *gyro) {
    uint8_t i;
    int32_t index = 0;
    if (dmp->feature_mask & (DMP_FEATURE_LP_QUAT | DMP_FEATURE_6X_LP_QUAT)) {
        for (i = 0; i < 4; i++) {
            quat[i] = (long)(((long)raw_data[4*i] << 24) | ((long)raw_data[4*i+1] << 16) |
                    ((long)raw_data[4*i+2] << 8) | raw_data[4*i+3]);
        }
        index += 16;
    }
    if (dmp->feature_mask & DMP_FEATURE_SEND_RAW_ACCEL) {
        for (i = 0; i < 3; i++) {
            accel[i] = (int16_t)(((int16_t)raw_data[index+2*i] << 8) | raw_data[index+2*i+1]);
        }
        index += 6;
    }
    if (dmp->feature_mask & DMP_FEATURE_SEND_ANY_GYRO) {
        for (i = 0; i < 3; i++) {
            gyro[i] = (int16_t)(((int16_t)raw_data[index+2*i] << 8) | raw_data[index+2*i]);
        }
    }
}

