VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
    Compass_WriteByte(AKM_REG_CNTL, AKM_POWER_DOWN);
    Compass_WriteByte(AKM_REG_ASTC, AKM_BIT_SELF_TEST);
    Compass_WriteByte(AKM_REG_CNTL, AKM_MODE_SELF_TEST);

    do {
        Delay_ms(10);
        tmp[0] = Compass_ReadByte(AKM_REG_ST1);
        if (tmp[0] & AKM_DATA_READY)
            break;
    } while (tries--);
    if (!(tmp[0] & AKM_DATA_READY))
        goto AKM_restore;

    Compass_Read(AKM_REG_HXL, tmp, 6);

    result = 0;
#if defined MPU9150
    data = (short)(tmp[1] << 8) | tmp[0];
    if ((data > 100) || (data < -100))
        result |= 0x01;
    data = (short)(tmp[3] << 8) | tmp[2];
    if ((data > 100) || (data < -100))
        result |= 0x02;
    data = (short)(tmp[5] << 8) | tmp[4];
    if ((data > -300) || (data < -1000))
        result |= 0x04;
#elif defined MPU9250
    data = (short)(tmp[1] << 8) | tmp[0];
    if ((data > 200) || (data < -200))  
        result |= 0x01;
    data = (short)(tmp[3] << 8) | tmp[2];
    if ((data > 200) || (data < -200))  
        result |= 0x02;
    data = (short)(tmp[5] << 8) | tmp[4];
    if ((data > -800) || (data < -3200))  
        result |= 0x04;
#endif
AKM_restore:
    Compass_WriteByte(AKM_REG_ASTC, SUPPORTS_AK89xx_HIGH_SENS);
    Compass_WriteByte(AKM_REG_CNTL, SUPPORTS_AK89xx_HIGH_SENS);

    return result;
}
#endif

static int accel_self_test(long *bias_regular, long *bias_st) {
    int i, result = 0, otp_value_zero = 0;
    float accel_st_al_min, accel_st_al_max;
    float st_shift_cust[3], st_shift_ratio[3], ct_shift_prod[3], accel_offset_max;
    uint8_t regs[3];
    
    MPU_Read(SELF_TEST_X_ACCEL, regs, 3);

	for (i = 0; i < 3; i++) {
		if (regs[i] != 0) {
			ct_shift_prod[i] = mpu_st_tb[regs[i] - 1];
			ct_shift_prod[i] *= 65536.f;
			ct_shift_prod[i] /= test->accel_sens;
		}
		else {
			ct_shift_prod[i] = 0;
			otp_value_zero = 1;
		}
	}
	if (otp_value_zero == 0) {
		for (i = 0; i < 3; i++) {
			st_shift_cust[i] = bias_st[i] - bias_regular[i];
			st_shift_ratio[i] = st_shift_cust[i] / ct_shift_prod[i];
			if (fabs(st_shift_ratio[i]) > test->max_accel_var) {
				result |= 1 << i;	//Error condition
			}
		}
	}
	else {
		/* Self Test Pass/Fail Criteria B */
		accel_st_al_min = test->min_g * 65536.f;
		accel_st_al_max = test->max_g * 65536.f;

		for (i = 0; i < 3; i++) {
			st_shift_cust[i] = bias_st[i] - bias_regular[i];
			if(st_shift_cust[i] < accel_st_al_min || st_shift_cust[i] > accel_st_al_max) {
				result |= 1 << i;	//Error condition
			}
		}
	}

	if (result == 0) {
	/* Self Test Pass/Fail Criteria C */
		accel_offset_max = .5f * 65536.f;
		for (i = 0; i < 3; i++) {
			if(fabs(bias_regular[i]) > accel_offset_max) {
				result |= 1 << i;	//Error condition
			}
		}
	}

    return result;
}

static int gyro_self_test(long *bias_regular, long *bias_st) {
    int i, result = 0, otp_value_zero = 0;
    float gyro_st_al_max;
    float st_shift_cust[3], st_shift_ratio[3], ct_shift_prod[3], gyro_offset_max;
    unsigned char regs[3];

    MPU_Read(SELF_TEST_X_GYRO, regs, 3);

	for (i = 0; i < 3; i++) {
		if (regs[i] != 0) {
			ct_shift_prod[i] = mpu_st_tb[regs[i] - 1];
			ct_shift_prod[i] *= 65536.f;
			ct_shift_prod[i] /= test->gyro_sens;
		}
		else {
			ct_shift_prod[i] = 0;
			otp_value_zero = 1;
		}
	}

	if(otp_value_zero == 0) {
		/* Self Test Pass/Fail Criteria A */
		for (i = 0; i < 3; i++) {
			st_shift_cust[i] = bias_st[i] - bias_regular[i];

			st_shift_ratio[i] = st_shift_cust[i] / ct_shift_prod[i];

			if (fabsf(st_shift_ratio[i]) < test->max_gyro_var) {
				result |= 1 << i;	//Error condition
			}
		}
	}
	else {
		/* Self Test Pass/Fail Criteria B */
		gyro_st_al_max = test->max_dps * 65536.f;

		for (i = 0; i < 3; i++) {
			st_shift_cust[i] = bias_st[i] - bias_regular[i];

			if(st_shift_cust[i] < gyro_st_al_max) {
				result |= 1 << i;	//Error condition
			}
		}
	}

	if(result == 0) {
	/* Self Test Pass/Fail Criteria C */
		gyro_offset_max = test->min_dps * 65536.f;
		for (i = 0; i < 3; i++) {
			if(fabsf(bias_regular[i]) > gyro_offset_max) {
				result |= 1 << i;	//Error condition
			}
		}
	}
    return result;
}
#define HWST_MAX_PACKET_LENGTH (512)

static void get_st_biases(long *gyro_bias, long *accel_bias, uint8_t hw_test) {
    uint8_t data[HWST_MAX_PACKET_LENGTH];
    uint8_t packet_count, ii;
    uint16_t fifo_count;
    int s = 0, read_size = 0, ind;

    data[0] = 0x01;
    data[1] = 0;
    MPU_Write(st->reg->pwr_mgmt_1, data, 2);
    Delay_ms(200);
    
    MPU_WriteByte(st->reg->int_enable,  0x00);
    MPU_WriteByte(st->reg->fifo_en,     0x00);
    MPU_WriteByte(st->reg->pwr_mgmt_1,  0x00);
    MPU_WriteByte(st->reg->i2c_mst,     0x00);
    MPU_WriteByte(st->reg->user_ctrl,   0x00);
    
    MPU_WriteByte(st->reg->user_ctrl, BIT_FIFO_RST | BIT_DMP_RST);
    Delay_ms(15);
    
    MPU_WriteByte(st->reg->lpf, st->test->reg_lpf);

    MPU_WriteByte(st->reg->rate_div, st->test->reg_rate_div);

    if (hw_test) {
        MPU_WriteByte(st->reg->gyro_cfg, st->test->reg_gyro_fsr | 0xE0);
        MPU_WriteByte(st->reg->accel_cfg, st->test->reg_accel_fsr | 0xE0);
    } else {
        MPU_WriteByte(st->reg->gyro_cfg, st->test->reg_gyro_fsr);
        MPU_WriteByte(st->reg->accel_cfg, st->test->reg_accel_fsr);
    }
    Delay_ms(test->wait_ms);  //wait 200ms for sensors to stabilize

    /* Enable FIFO */
    MPU_WriteByte(st->reg->user_ctrl, BIT_FIFO_EN);
    MPU_WriteByte(st->reg->fifo_en, INV_XYZ_GYRO | INV_XYZ_ACCEL);

    //initialize the bias return values
    gyro_bias[0] = gyro_bias[1] = gyro_bias[2] = 0;
    accel_bias[0] = accel_bias[1] = accel_bias[2] = 0;

    //start reading samples
    while (s < test->packet_thresh) {
    	Delay_ms(10); //wait 10ms to fill FIFO
		MPU_Read(st->reg->fifo_count_h, data, 2);
		fifo_count = (data[0] << 8) | data[1];
		packet_count = fifo_count / MAX_PACKET_LENGTH;
		if ((test->packet_thresh - s) < packet_count) {
            packet_count = test->packet_thresh - s;
        }
		read_size = packet_count * MAX_PACKET_LENGTH;

		//burst read from FIFO
		MPU_Read(st->reg->fifo_r_w, data, read_size);

		ind = 0; 
		for (ii = 0; ii < packet_count; ii++) {
			short accel_cur[3], gyro_cur[3];
			accel_cur[0] = ((short)data[ind + 0] << 8) | data[ind + 1];
			accel_cur[1] = ((short)data[ind + 2] << 8) | data[ind + 3];
			accel_cur[2] = ((short)data[ind + 4] << 8) | data[ind + 5];
			accel_bias[0] += (long)accel_cur[0];
			accel_bias[1] += (long)accel_cur[1];
			accel_bias[2] += (long)accel_cur[2];
			gyro_cur[0] = (((short)data[ind + 6] << 8) | data[ind + 7]);
			gyro_cur[1] = (((short)data[ind + 8] << 8) | data[ind + 9]);
			gyro_cur[2] = (((short)data[ind + 10] << 8) | data[ind + 11]);
			gyro_bias[0] += (long)gyro_cur[0];
			gyro_bias[1] += (long)gyro_cur[1];
			gyro_bias[2] += (long)gyro_cur[2];
			ind += MAX_PACKET_LENGTH;
		}
		s += packet_count;
    }

    //stop FIFO
    MPU_WriteByte(st->reg->fifo_en, 0x00);

