VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
    gyro_bias[0] = (long)(((long long)gyro_bias[0]<<16) / test->gyro_sens / s);
    gyro_bias[1] = (long)(((long long)gyro_bias[1]<<16) / test->gyro_sens / s);
    gyro_bias[2] = (long)(((long long)gyro_bias[2]<<16) / test->gyro_sens / s);
    accel_bias[0] = (long)(((long long)accel_bias[0]<<16) / test->accel_sens / s);
    accel_bias[1] = (long)(((long long)accel_bias[1]<<16) / test->accel_sens / s);
    accel_bias[2] = (long)(((long long)accel_bias[2]<<16) / test->accel_sens / s);
    /* remove gravity from bias calculation */
    if (accel_bias[2] > 0L)
        accel_bias[2] -= 65536L;
    else
        accel_bias[2] += 65536L;
}

/**
 *  @brief      Trigger gyro/accel/compass self-test for MPU6500/MPU9250
 *  On success/error, the self-test returns a mask representing the sensor(s)
 *  that failed. For each bit, a one (1) represents a "pass" case; conversely,
 *  a zero (0) indicates a failure.
 *
 *  \n The mask is defined as follows:
 *  \n Bit 0:   Gyro.
 *  \n Bit 1:   Accel.
 *  \n Bit 2:   Compass.
 *
 *  @param[out] gyro        Gyro biases in q16 format.
 *  @param[out] accel       Accel biases (if applicable) in q16 format.
 *  @param[in]  debug       Debug flag used to print out more detailed logs. Must first set up logging in Motion Driver.
 *  @return     Result mask (see above).
 */
int MPU_RunSelfTest(long *gyro_bias, long *accel_bias) {
    long gyro_st[3], accel_st[3];
    uint8_t accel_result, gyro_result;
#ifdef AK89xx_SECONDARY
    uint8_t compass_result;
#endif
    int ii;

    int result;
    uint8_t accel_fsr, fifo_sensors, sensors_on;
    uint16_t gyro_fsr, sample_rate, lpf;
    uint8_t dmp_was_on;

    if (st->chip_cfg.dmp_on) {
        MPU_SetDMPState(0);
        dmp_was_on = 1;
    } else
        dmp_was_on = 0;

    /* Get initial settings. */
    MPU_GetGyroFsr(&gyro_fsr);
    MPU_GetAccelFsr(&accel_fsr);
    MPU_GetLPF(&lpf);
    MPU_GetSampleRate(&sample_rate);
    sensors_on = st->chip_cfg.sensors;
    MPU_GetFIFOConfig(&fifo_sensors);

    get_st_biases(gyro_bias, accel_bias, 0);
    get_st_biases(gyro_st, accel_st, 1);

    accel_result = accel_self_test(accel_bias, accel_st);

    gyro_result = gyro_self_test(gyro_bias, gyro_st);

    result = 0;
    if (!gyro_result)
        result |= 0x01;
    if (!accel_result)
        result |= 0x02;

#ifdef AK89xx_SECONDARY
    compass_result = compass_self_test();
    if (!compass_result)
        result |= 0x04;
#else
    result |= 0x04;
#endif
	/* Set to invalid values to ensure no I2C writes are skipped. */
	st->chip_cfg.gyro_fsr = 0xFF;
	st->chip_cfg.accel_fsr = 0xFF;
	st->chip_cfg.lpf = 0xFF;
	st->chip_cfg.sample_rate = 0xFFFF;
	st->chip_cfg.sensors = 0xFF;
	st->chip_cfg.fifo_enable = 0xFF;
	st->chip_cfg.clk_src = INV_CLK_PLL;
	MPU_SetGyroFsr(gyro_fsr);
	MPU_SetAccelFsr(accel_fsr);
	MPU_SetAccelFsr(lpf);
	MPU_SetSampleRate(sample_rate);
	MPU_SetSensors(sensors_on);
	MPU_ConfigureFIFO(fifo_sensors);

	if (dmp_was_on)
		MPU_SetDMPState(1);

	return result;
}

/**
 *  @brief      Read biases to the accel bias 6500 registers.
 *  This function reads from the MPU6500 accel offset cancellations registers.
 *  The format are G in +-8G format. The register is initialized with OTP 
 *  factory trim values.
 *  @param[in]  accel_bias  returned structure with the accel bias
 *  @return     0 if successful.
 */
int MPU_ReadAccelBias(long *accel_bias) {
	uint8_t data[6];
	MPU_Read(XA_OFFSET_H, &data[0], 2);
    MPU_Read(YA_OFFSET_H, &data[2], 2);
    MPU_Read(ZA_OFFSET_H, &data[4], 2);
	accel_bias[0] = ((long)data[0]<<8) | data[1];
	accel_bias[1] = ((long)data[2]<<8) | data[3];
	accel_bias[2] = ((long)data[4]<<8) | data[5];
	return 0;
}

/**
 *  @brief      Push biases to the accel bias 6500 registers.
 *  This function expects biases relative to the current sensor output, and
 *  these biases will be added to the factory-supplied values. Bias inputs are LSB
 *  in +-16G format.
 *  @param[in]  accel_bias  New biases.
 *  @return     0 if successful.
 */
int MPU_SetAccelBias(const long *accel_bias) {
    uint8_t data[6] = {0, 0, 0, 0, 0, 0};
    long accel_reg_bias[3] = {0, 0, 0};

    MPU_ReadAccelBias(accel_reg_bias);

    // Preserve bit 0 of factory value (for temperature compensation)
    accel_reg_bias[0] -= (accel_bias[0] & ~1);
    accel_reg_bias[1] -= (accel_bias[1] & ~1);
    accel_reg_bias[2] -= (accel_bias[2] & ~1);

    data[0] = (accel_reg_bias[0] >> 8) & 0xff;
    data[1] = (accel_reg_bias[0]) & 0xff;
    data[2] = (accel_reg_bias[1] >> 8) & 0xff;
    data[3] = (accel_reg_bias[1]) & 0xff;
    data[4] = (accel_reg_bias[2] >> 8) & 0xff;
    data[5] = (accel_reg_bias[2]) & 0xff;

    if (MPU_WriteAndCheck(XA_OFFSET_H, &data[0], 2)) {
        return -1;
    }
    if (MPU_WriteAndCheck(YA_OFFSET_H, &data[2], 2)) {
        return -1;
    }
    if (MPU_WriteAndCheck(ZA_OFFSET_H, &data[4], 2)) {
        return -1;
    }
    return 0;
}

int MPU_ReadGyroBias(long *gyro_bias) {
	uint8_t data[6];
	MPU_Read(XG_OFFSET_H, &data[0], 2);
    MPU_Read(YG_OFFSET_H, &data[2], 2);
    MPU_Read(ZG_OFFSET_H, &data[4], 2);
	gyro_bias[0] = ((long)data[0]<<8) | data[1];
	gyro_bias[1] = ((long)data[2]<<8) | data[3];
	gyro_bias[2] = ((long)data[4]<<8) | data[5];
	return 0;
}

/**
 *  @brief      Push biases to the gyro bias 6500/6050 registers.
 *  This function expects biases relative to the current sensor output, and
 *  these biases will be added to the factory-supplied values. Bias inputs are LSB
 *  in +-1000dps format.
 *  @param[in]  gyro_bias  New biases.
 *  @return     0 if successful.
 */
int MPU_SetGyroBias(long *gyro_bias)
{
    uint8_t data[6] = {0, 0, 0, 0, 0, 0};
    uint8_t i=0;
    for(i = 0; i < 3; i++) {
    	gyro_bias[i]= (-gyro_bias[i]);
    }
    data[0] = (gyro_bias[0] >> 8) & 0xff;
    data[1] = (gyro_bias[0]) & 0xff;
    data[2] = (gyro_bias[1] >> 8) & 0xff;
    data[3] = (gyro_bias[1]) & 0xff;
    data[4] = (gyro_bias[2] >> 8) & 0xff;
    data[5] = (gyro_bias[2]) & 0xff;
    if (MPU_WriteAndCheck(XG_OFFSET_H, &data[0], 2)) {
        return -1;
    }
    if (MPU_WriteAndCheck(YG_OFFSET_H, &data[2], 2)) {
        return -1;
    }
    if (MPU_WriteAndCheck(ZG_OFFSET_H, &data[4], 2)) {
        return -1;
    }
    return 0;
}

